{"weightsManifest": [{"weights": [{"shape": [6, 64], "name": "dense_1/kernel", "dtype": "float32"}, {"shape": [64], "name": "dense_1/bias", "dtype": "float32"}], "paths": ["group1-shard1of1"]}, {"weights": [{"shape": [64, 64], "name": "dense_2/kernel", "dtype": "float32"}, {"shape": [64], "name": "dense_2/bias", "dtype": "float32"}], "paths": ["group2-shard1of1"]}, {"weights": [{"shape": [64, 3], "name": "dense_3/kernel", "dtype": "float32"}, {"shape": [3], "name": "dense_3/bias", "dtype": "float32"}], "paths": ["group3-shard1of1"]}], "modelTopology": {"keras_version": "2.1.4", "backend": "tensorflow", "model_config": {"config": [{"config": {"kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "bias_constraint": null, "batch_input_shape": [null, 6], "name": "dense_1", "dtype": "float32", "use_bias": true, "units": 64, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "relu"}, "class_name": "Dense"}, {"config": {"rate": 0.5, "noise_shape": null, "trainable": true, "name": "dropout_1", "seed": null}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "use_bias": true, "units": 64, "name": "dense_2", "activation": "relu"}, "class_name": "Dense"}, {"config": {"rate": 0.5, "noise_shape": null, "trainable": true, "name": "dropout_2", "seed": null}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "use_bias": true, "units": 3, "name": "dense_3", "activation": "softmax"}, "class_name": "Dense"}], "class_name": "Sequential"}, "training_config": {"sample_weight_mode": null, "loss_weights": null, "optimizer_config": {"config": {"beta_2": 0.9990000128746033, "beta_1": 0.8999999761581421, "amsgrad": false, "decay": 0.0, "lr": 0.0010000000474974513, "epsilon": 1e-07}, "class_name": "Adam"}, "loss": "categorical_crossentropy", "metrics": ["accuracy"]}}}